<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"1109a57ab562f019523eff7448758b4fc1fb74241717a7775ec2aa89c62ca4b6","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1353 at https://github.com/cal-itp/data-infra/actions/runs/20985178894","plan_out_hash":"2fef622510be510b4f6c71febd2b7e2bc439f04c9b6dc93e1051946922d779fe","plan_hash":"c33c78d0bbecd0ea33d2ccbfdf92de738c0c53ce3d516aa3944ff15f86e0fba3","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_daily_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "psg0VA==" -> (known after apply)
!~      detect_md5hash      = "sTYhDAnQTGy9278Bfc8NHA==" -> "different hash"
!~      generation          = 1768369948664644 -> (known after apply)
        id                  = "calitp-staging-composer-dags/dbt_daily_dag.py"
!~      md5hash             = "sTYhDAnQTGy9278Bfc8NHA==" -> (known after apply)
        name                = "dags/dbt_daily_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs_audit/dim_gtfs_schedule_file_parse_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "ohnBEQ==" -> (known after apply)
!~      detect_md5hash      = "bsBxAZ1o8tB45vjGNYgwLw==" -> "different hash"
!~      generation          = 1768369948756185 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs_audit/dim_gtfs_schedule_file_parse_outcomes.sql"
!~      md5hash             = "bsBxAZ1o8tB45vjGNYgwLw==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs_audit/dim_gtfs_schedule_file_parse_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1353](https://github.com/cal-itp/data-infra/actions/runs/20985178894)